# IsPlanar Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..IsPlanar Method
AnalyticalModelSurface Class See Also
---
Indicates if the Analytical Model Surface Element is planar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsPlanar()
```

Visual Basic
---
```text
Public Function IsPlanar As Boolean
```

Visual C++
---
```text
public:
bool IsPlanar()
```

# ### Return Value
True if Analytical Model Surface Element is planar, false otherwise.
# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace